clear all;
clc;

% модель часового ряду
N=12;% довжина часового ряду, кількість спостережень
t=1:N;
N2=N/2;
%   1  2  3  4  5      6  7  8  9 10      11 12 13 14 15 16 17 18 19 20
%Y=[56 54 52 53 52     53 55 57 54 55      54 55 51 53 56 54 56 55 52 51];%
Y=[239.5 289.3 340.7 375.3 393.8 213.8 173.4 221.5 275.3 332.3 430.5 437.6];
%Y=5*sin(t);%
%Y=10*ones(1,N)+0.01*rand(1,N);
% Y=t;
%Y=rand(1,N).*rand(1,N).*rand(1,N);

Y_avg=mean(Y); % знаходження МО
D=cov(Y); % розрахунок дисперсії
COR=xcorr(Y);% повертає послідовність автокореляції

figure(1)
[acf, lags]=autocorr(Y);
stem(lags,acf)% будує графік функції автокореляції (корелограми)
grid on

% Коефіцієнт кореляції Пірсона
P=((t-mean(t))*(Y-mean(Y))')/sqrt(((t-mean(t))*(t-mean(t))')*((Y-mean(Y))*(Y-mean(Y))'))
% МЕТОД КРАЙНІХ ТОЧОК

% коефіцієнти рівняння прямої y=b1*t+b0
b1=(Y(N2)-Y(1))/(t(N2)-t(1)) 
b0=Y(1)-b1*t(1)
Y1=b0+b1*t; % реалізація моделі прогнозування
%прогноз на один крок вперед%
shag_1=Y1(N/2+1)
% розрахунок показників помилок прогнозу
e_mkt=Y(N/2+1)-Y1(N/2+1) % помилка прогнозу
delta_mkt=abs(Y(N/2+1)-Y1(N/2+1)) % абсолютна помилка прогнозу
eps_mkt=abs(Y(N/2+1)-Y1(N/2+1))/Y(N/2+1) % відносна помилка прогнозу

% середня абсолютна помилка прогнозу
MAE_mkt=0;
for i=(N/2+1):N
    MAE_mkt=MAE_mkt+abs(Y(i)-Y1(i));
end
MAE_mkt=MAE_mkt/(N/2)

% середня абсолютна відсоткова помилка прогнозу
MAPE_mkt=0;
for i=(N/2+1):N
    MAPE_mkt=MAPE_mkt+abs(Y(i)-Y1(i))/Y(i);
end
MAPE_mkt=100*MAPE_mkt/(N/2)
% середня відсоткова помилка прогнозу
MPE_mkt=0;
for i=(N/2+1):N
    MPE_mkt=MPE_mkt+(Y(i)-Y1(i))/Y(i);
end
MPE_mkt=100*MPE_mkt/(N/2)

%коефіцієнт детермінації
R2_mkt=1-(sum((Y-Y1).^2))/(sum((Y-Y_avg).^2))

%------------------------------------------------------------


% МЕТОД СЕРЕДНІХ ТОЧОК

t1=sum(t(1:N/2))/(N/2);
t2=sum(t((N/2+1):N))/(N/2);

y1=sum(Y(1:N/2))/(N/2);
y2=sum(Y((N/2+1):N))/(N/2);

% коефіцієнти рівняння прямої y=a1*t+a0
a1=(y2-y1)/(t2-t1)
a0=y1-a1*t1
Y2=a0+a1*t; % реалізація моделі прогнозування
%прогноз на один крок вперед%
shag_1=Y2(N/2+1)
% розрахунок показників помилок прогнозу
e_mst=Y(N/2+1)-Y2(N/2+1) % помилка прогнозу
delta_mst=abs(Y(N/2+1)-Y2(N/2+1)) % абсолютна помилка прогнозу
eps_mst=abs(Y(N/2+1)-Y2(N/2+1))/Y(N/2+1) % відносна помилка прогнозу

% середня абсолютна помилка прогнозу
MAE_mst=0;
for i=(N/2+1):N
    MAE_mst=MAE_mst+abs(Y(i)-Y2(i));
end
MAE_mst=MAE_mst/(N/2)

% середня абсолютна відсоткова помилка прогнозу
MAPE_mst=0;
for i=(N/2+1):N
    MAPE_mst=MAPE_mst+abs(Y(i)-Y2(i))/Y(i);
end
MAPE_mst=100*MAPE_mst/(N/2)

% середня відсоткова помилка прогнозу
MPE_mst=0;
for i=(N/2+1):N
    MPE_mst=MPE_mst+(Y(i)-Y2(i))/Y(i);
end
MPE_mst=100*MPE_mst/(N/2)

%коефіцієнт детермінації
R2_mst=1-(sum((Y-Y2).^2))/(sum((Y-Y_avg).^2))


figure(2)
plot(t,Y,'-kp',t,Y1,'-.rs',t,Y2,'-b*')
grid on
legend('Y','YmKT','YmST')
xlabel('час');
ylabel('Y');